Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.1.45/atdf/PIC32MZ2048EFG124.atdf
      <value-group caption="TX Hub Multiple Translators bit" name="USBE1TXA__MULTTRAN">
         <value caption="The USB 2.0 hub has multiple transaction translators" name="" value="0x1"/>
         <value caption="The USB 2.0 hub has a single transaction translator" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX Hub Multiple Translators bit" name="USBE1RXA__MULTTRAN">
         <value caption="The USB 2.0 hub has multiple transaction translators" name="" value="0x1"/>
         <value caption="The USB 2.0 hub has a single transaction translator" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX Hub Multiple Translators bit" name="USBE2TXA__MULTTRAN">
         <value caption="The USB 2.0 hub has multiple transaction translators" name="" value="0x1"/>
         <value caption="The USB 2.0 hub has a single transaction translator" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX Hub Multiple Translators bit" name="USBE2RXA__MULTTRAN">
         <value caption="The USB 2.0 hub has multiple transaction translators" name="" value="0x1"/>
         <value caption="The USB 2.0 hub has a single transaction translator" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX Hub Multiple Translators bit" name="USBE3TXA__MULTTRAN">
         <value caption="The USB 2.0 hub has multiple transaction translators" name="" value="0x1"/>
         <value caption="The USB 2.0 hub has a single transaction translator" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX Hub Multiple Translators bit" name="USBE3RXA__MULTTRAN">
         <value caption="The USB 2.0 hub has multiple transaction translators" name="" value="0x1"/>
         <value caption="The USB 2.0 hub has a single transaction translator" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX Hub Multiple Translators bit" name="USBE4TXA__MULTTRAN">
         <value caption="The USB 2.0 hub has multiple transaction translators" name="" value="0x1"/>
         <value caption="The USB 2.0 hub has a single transaction translator" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX Hub Multiple Translators bit" name="USBE4RXA__MULTTRAN">
         <value caption="The USB 2.0 hub has multiple transaction translators" name="" value="0x1"/>
         <value caption="The USB 2.0 hub has a single transaction translator" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX Hub Multiple Translators bit" name="USBE5TXA__MULTTRAN">
         <value caption="The USB 2.0 hub has multiple transaction translators" name="" value="0x1"/>
         <value caption="The USB 2.0 hub has a single transaction translator" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX Hub Multiple Translators bit" name="USBE5RXA__MULTTRAN">
         <value caption="The USB 2.0 hub has multiple transaction translators" name="" value="0x1"/>
         <value caption="The USB 2.0 hub has a single transaction translator" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX Hub Multiple Translators bit" name="USBE6TXA__MULTTRAN">
         <value caption="The USB 2.0 hub has multiple transaction translators" name="" value="0x1"/>
         <value caption="The USB 2.0 hub has a single transaction translator" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Channel 1 Interrupt bit" name="USBDMAINT__DMA1IF">
         <value caption="The DMA channel has an interrupt event" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Channel 2 Interrupt bit" name="USBDMAINT__DMA2IF">
         <value caption="The DMA channel has an interrupt event" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Channel 3 Interrupt bit" name="USBDMAINT__DMA3IF">
         <value caption="The DMA channel has an interrupt event" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Channel 4 Interrupt bit" name="USBDMAINT__DMA4IF">
         <value caption="The DMA channel has an interrupt event" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Channel 5 Interrupt bit" name="USBDMAINT__DMA5IF">
         <value caption="The DMA channel has an interrupt event" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Channel 6 Interrupt bit" name="USBDMAINT__DMA6IF">
         <value caption="The DMA channel has an interrupt event" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Channel 7 Interrupt bit" name="USBDMAINT__DMA7IF">
         <value caption="The DMA channel has an interrupt event" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Channel 8 Interrupt bit" name="USBDMAINT__DMA8IF">
         <value caption="The DMA channel has an interrupt event" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="02831" name="USBCLKRST" version="2">
      <register-group name="USBCLKRST">
         <register caption="USB Clock/Reset Control Register" name="USBCRCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="USB Activity Detection Interrupt Enable bit" mask="0x00000001" name="USBWKUPEN" values="USBCRCON__USBWKUPEN"/>
            <bitfield caption="USB Resume Interrupt Enable bit" mask="0x00000002" name="USBRIE" values="USBCRCON__USBRIE"/>
            <bitfield caption="USB General Interrupt Enable bit" mask="0x00000004" name="USBIE" values="USBCRCON__USBIE"/>
            <bitfield caption="Session End Vbus Monitoring for OTG Enable bit" mask="0x00000008" name="SENDMONEN" values="USBCRCON__SENDMONEN"/>
            <bitfield caption="B-Device Vbus Monitoring for OTG Enable bit" mask="0x00000010" name="BSVALMONEN" values="USBCRCON__BSVALMONEN"/>
            <bitfield caption="A-Device Vbus Monitoring for OTG Enable bit" mask="0x00000020" name="ASVALMONEN" values="USBCRCON__ASVALMONEN"/>
            <bitfield caption="Vbus Monitoring for OTG Enable bit" mask="0x00000040" name="VBUSMONEN" values="USBCRCON__VBUSMONEN"/>
            <bitfield caption="PHY ID Monitoring Enable bit" mask="0x00000080" name="PHYIDEN" values="USBCRCON__PHYIDEN"/>
            <bitfield caption="USB ID Value bit" mask="0x00000100" name="USBIDVAL" values="USBCRCON__USBIDVAL"/>
            <bitfield caption="USB ID Override Enable bit" mask="0x00000200" name="USBIDOVEN" values="USBCRCON__USBIDOVEN"/>
            <bitfield caption="USB Activity Status bit" mask="0x01000000" name="USBWK" values="USBCRCON__USBWK"/>
            <bitfield caption="USB Resume Flag bit" mask="0x02000000" name="USBRF" values="USBCRCON__USBRF"/>
            <bitfield caption="USB General Interrupt Flag bit" mask="0x04000000" name="USBIF" values="USBCRCON__USBIF"/>
         </register>
      </register-group>
      <value-group caption="USB Activity Detection Interrupt Enable bit" name="USBCRCON__USBWKUPEN">
         <value caption="Enable interrupt for detection of activity on USB bus in Sleep mode" name="" value="0x1"/>
         <value caption="Disable interrupt for detection of activity on USB bus in Sleep mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="USB Resume Interrupt Enable bit" name="USBCRCON__USBRIE">
         <value caption="Enable remote resume from suspend Interrupt" name="" value="0x1"/>
         <value caption="Disable interrupt to a Remote Devices USB resume signaling" name="" value="0x0"/>
      </value-group>
      <value-group caption="USB General Interrupt Enable bit" name="USBCRCON__USBIE">
         <value caption="Enables general interrupt from USB module" name="" value="0x1"/>
         <value caption="Disables general interrupt from USB module" name="" value="0x0"/>
      </value-group>
      <value-group caption="Session End Vbus Monitoring for OTG Enable bit" name="USBCRCON__SENDMONEN">
         <value caption="Enable monitoring for Vbus in Session End range (between 0.2V and 0.8V)" name="" value="0x1"/>
         <value caption="Disable monitoring for Vbus in Session End range" name="" value="0x0"/>
      </value-group>
      <value-group caption="B-Device Vbus Monitoring for OTG Enable bit" name="USBCRCON__BSVALMONEN">
         <value caption="Enable monitoring for Vbus in Session Valid range for B-device (between 0.8V and 4.0V)" name="" value="0x1"/>
         <value caption="Disable monitoring for Vbus in Session Valid range for B-device" name="" value="0x0"/>
      </value-group>
      <value-group caption="A-Device Vbus Monitoring for OTG Enable bit" name="USBCRCON__ASVALMONEN">
         <value caption="Enable monitoring for Vbus in Session Valid range for A-device (between 0.8V and 2.0V)" name="" value="0x1"/>
         <value caption="Disable monitoring for Vbus in Session Valid range for A-device" name="" value="0x0"/>
      </value-group>
      <value-group caption="Vbus Monitoring for OTG Enable bit" name="USBCRCON__VBUSMONEN">
         <value caption="Enable monitoring for Vbus in VBUS Valid range (between 4.4V and 4.75V)" name="" value="0x1"/>
         <value caption="Disable monitoring for Vbus in VBUS Valid range" name="" value="0x0"/>
      </value-group>
